### Terraform has applied changes to infrastructre

<details><summary>Show deployment details</summary>

\`\`\`\n
[0m[33mRunning apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.[0m

Preparing the remote apply...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/omshub/core-api/runs/run-B7xj6mPbuqLJDEUL[0m
[0m
Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
[0m[1mdigitalocean_app.app_core_api: Refreshing state... [id=8d53b504-8e69-4348-b19f-870b73d029b9][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # digitalocean_app.app_core_api[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "digitalocean_app" "app_core_api" {
      [31m-[0m [0m[1m[0mactive_deployment_id[0m[0m = "fecd3f1e-8168-4de7-b9cf-2de47ee43b17" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreated_at[0m[0m           = "2022-05-18 01:43:19 +0000 UTC" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdefault_ingress[0m[0m      = "https://core-api-rcgza.ondigitalocean.app" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                   = "8d53b504-8e69-4348-b19f-870b73d029b9" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlive_url[0m[0m             = "https://core-api-rcgza.ondigitalocean.app" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mupdated_at[0m[0m           = "2022-05-18 01:45:16 +0000 UTC" [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mspec {
          [31m-[0m [0m[1m[0mdomains[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mname[0m[0m    = "core-api" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mregion[0m[0m  = "nyc1" [90m->[0m [0m[90mnull[0m[0m

          [31m-[0m [0mservice {
              [31m-[0m [0m[1m[0mdockerfile_path[0m[0m    = "Dockerfile" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mhttp_port[0m[0m          = 1927 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0minstance_count[0m[0m     = 1 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0minstance_size_slug[0m[0m = "basic-xxs" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0minternal_ports[0m[0m     = [] [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mname[0m[0m               = "core-api" [90m->[0m [0m[90mnull[0m[0m

              [31m-[0m [0mgithub {
                  [31m-[0m [0m[1m[0mbranch[0m[0m         = "ci/deploy-service-to-do" [90m->[0m [0m[90mnull[0m[0m
                  [31m-[0m [0m[1m[0mdeploy_on_push[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
                  [31m-[0m [0m[1m[0mrepo[0m[0m           = "omshub/core-api" [90m->[0m [0m[90mnull[0m[0m
                }

              [31m-[0m [0mroutes {
                  [31m-[0m [0m[1m[0mpath[0m[0m                 = "/" [90m->[0m [0m[90mnull[0m[0m
                  [31m-[0m [0m[1m[0mpreserve_path_prefix[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
                }
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # digitalocean_app.app_core_api[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "digitalocean_app" "app_core_api" {
      [32m+[0m [0m[1m[0mactive_deployment_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mcreated_at[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_ingress[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mlive_url[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mupdated_at[0m[0m           = (known after apply)

      [32m+[0m [0mspec {
          [32m+[0m [0m[1m[0mdomains[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m    = "core-api"
          [32m+[0m [0m[1m[0mregion[0m[0m  = "nyc"

          [32m+[0m [0mdomain {
              [32m+[0m [0m[1m[0mname[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mwildcard[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mzone[0m[0m     = (known after apply)
            }

          [32m+[0m [0mservice {
              [32m+[0m [0m[1m[0mdockerfile_path[0m[0m    = "Dockerfile"
              [32m+[0m [0m[1m[0mhttp_port[0m[0m          = 1927
              [32m+[0m [0m[1m[0minstance_count[0m[0m     = 1
              [32m+[0m [0m[1m[0minstance_size_slug[0m[0m = "basic-xxs"
              [32m+[0m [0m[1m[0mname[0m[0m               = "core-api"
              [32m+[0m [0m[1m[0mrun_command[0m[0m        = (known after apply)

              [32m+[0m [0mgithub {
                  [32m+[0m [0m[1m[0mbranch[0m[0m         = "ci/deploy-service-to-do"
                  [32m+[0m [0m[1m[0mdeploy_on_push[0m[0m = false
                  [32m+[0m [0m[1m[0mrepo[0m[0m           = "omshub/core-api"
                }

              [32m+[0m [0mroutes {
                  [32m+[0m [0m[1m[0mpath[0m[0m = "/"
                }
            }
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0mdo_app_deployment_id[0m[0m = "fecd3f1e-8168-4de7-b9cf-2de47ee43b17" [33m->[0m [0m(known after apply)
  [33m~[0m [0m[1m[0mdo_app_url[0m[0m           = "https://core-api-rcgza.ondigitalocean.app" [33m->[0m [0m(known after apply)

[0m[1mdigitalocean_app.app_core_api: Creating...[0m[0m
[0m[1mdigitalocean_app.app_core_api: Still creating... [10s elapsed][0m[0m
[0m[1mdigitalocean_app.app_core_api: Still creating... [20s elapsed][0m[0m
[0m[1mdigitalocean_app.app_core_api: Still creating... [30s elapsed][0m[0m
[0m[1mdigitalocean_app.app_core_api: Still creating... [40s elapsed][0m[0m
[0m[1mdigitalocean_app.app_core_api: Still creating... [50s elapsed][0m[0m
[0m[1mdigitalocean_app.app_core_api: Still creating... [1m0s elapsed][0m[0m
[0m[1mdigitalocean_app.app_core_api: Still creating... [1m10s elapsed][0m[0m
[0m[1mdigitalocean_app.app_core_api: Still creating... [1m20s elapsed][0m[0m
[0m[1mdigitalocean_app.app_core_api: Still creating... [1m30s elapsed][0m[0m
[0m[1mdigitalocean_app.app_core_api: Still creating... [1m40s elapsed][0m[0m
[0m[1mdigitalocean_app.app_core_api: Creation complete after 1m43s [id=3bc1da9c-52ee-4a8c-bc3e-ed5da4fe9314][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[0m[0m[1m[32m
Outputs:

[0mdo_app_deployment_id = "ed9f5361-33b1-48c5-bc27-e7f4fb9db830"
do_app_url = "https://core-api-u63wx.ondigitalocean.app"

\`\`\`

</details>
<!-- Sticky Pull Request Commentterraform deploy -->